exports.data =[
        [1 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [2 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [3 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [4 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [5 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [6 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [7 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg'],
        [8 ,"පාටිභොග සහ තයෝ ධම්ම සූත්‍ර" ,'https://jksdhkg']];

